export const messages = {
  INFO: {
    I001: 'ユーザー登録が完了しました。\nログインしてください。',
    I002: 'メモを新規作成しました。',
    I003: 'メモを更新しました。',
    I004: 'メモを削除しました。',
    I005: 'フォルダを新規作成しました。',
    I006: 'フォルダを更新しました。',
    I007: 'フォルダを削除しました。',
    I008: 'ユーザー情報を更新しました。',
    I009: '問い合わせ内容の送信が完了しました。'
  },
  WARNING: {
    W001: 'メモを新規作成中です。\n内容を破棄し、別のメモを編集しますか？',
    W002: 'メモを編集中です。\n内容を破棄し、新しいメモを作成しますか？',
    W003: '内容が保存されていません。\n メモを閉じますか?',
    W004: 'メモを編集中です。\n内容を破棄し、別のメモを開きますか？',
    W005: '選択中のメモを削除しますか？',
    W006: 'ログアウトします。\nよろしいですか？',
    W007: 'ユーザーを削除します。\n削除すると作成したメモは全て消去されます。よろしいですか？',
    W008: 'ユーザー情報を編集中です。\n内容を破棄して画面を移動しますか？',
    W009: '問い合わせ内容を現在の内容で送信します。\nよろしいですか？'
  },
  ERROR: {
    E001: 'システムエラーが発生しました。\nトップページに遷移します。',
    E002: 'タイトルは入力必須です。',
    E003: 'パスワード(確認用)が誤っています。\nパスワードを確認してください。',
    E004: 'パスワードポリシー違反です。\n英大文字・英小文字・数字の全てを含めてください。',
    E005: '未入力の項目があります。\n確認してください。',
    E006: 'ユーザーIDが不正です。\n8字以上20字以下で設定してください。',
    E007: 'パスワードが不正です。\n8字以上20字以下で設定してください。',
    E008: 'ユーザー名が不正です。\n2字以上20字以下で設定してください。',
    E009: '既に存在するユーザーIDが使用されています。\n別のIDで登録してください。',
    E010: 'パスワードが異なります。\n入力内容を確認してください。',
    E011: '存在しないユーザーです。\n入力内容を確認してください。',
    E012: 'タイトルの文字数が上限を超過しています。\n50文字以内で入力してください。',
    E013: '入力が不足しています。パスワードを変更する場合は、\n現在のパスワード・新しいパスワード・新しいパスワード(確認用)の全てを入力してください。',
    E014: '更新する項目がありません。',
    E015: 'セッションの有効期限が切れています。\n再度ログインしてください。'
  },
};